8DNC8/Project_DNC/STM32/智能鱼缸_HAL/code/OLED.h
/*
 * OLED.h
 *
 *  说明：0.96寸OLED（SSD1306，128×64，I2C）驱动头文件
 *        硬件连接：PB6→SCL，PB7→SDA（硬件I2C1）
 */
#ifndef __OLED_H__
#define __OLED_H__

#include "stm32f1xx_hal.h"

/* 引脚定义（硬件I2C，以下宏保留供软件I2C备用） */
#define OLED_GPIO_CLK_ENABLE()  __HAL_RCC_GPIOA_CLK_ENABLE()
#define GPIOx_OLED_PORT         GPIOB
#define OLED_SCK_PIN            GPIO_PIN_6
#define OLED_SCK_ON()           HAL_GPIO_WritePin(GPIOx_OLED_PORT, OLED_SCK_PIN, GPIO_PIN_SET)
#define OLED_SCK_OFF()          HAL_GPIO_WritePin(GPIOx_OLED_PORT, OLED_SCK_PIN, GPIO_PIN_RESET)
#define OLED_SCK_TOGGLE()       HAL_GPIO_TogglePin(GPIOx_OLED_PORT, OLED_SCK_PIN)
#define OLED_SDA_PIN            GPIO_PIN_7
#define OLED_SDA_ON()           HAL_GPIO_WritePin(GPIOx_OLED_PORT, OLED_SDA_PIN, GPIO_PIN_SET)
#define OLED_SDA_OFF()          HAL_GPIO_WritePin(GPIOx_OLED_PORT, OLED_SDA_PIN, GPIO_PIN_RESET)
#define OLED_SDA_TOGGLE()       HAL_GPIO_TogglePin(GPIOx_OLED_PORT, OLED_SDA_PIN)

/* 函数声明 */
void WriteCmd(void);
void OLED_WR_CMD(uint8_t cmd);
void OLED_WR_DATA(uint8_t data);
void OLED_Init(void);
void OLED_Clear(void);
void OLED_Display_On(void);
void OLED_Display_Off(void);
void OLED_Set_Pos(uint8_t x, uint8_t y);
void OLED_On(void);
void OLED_ShowNum(uint8_t x, uint8_t y, unsigned int num, uint8_t len, uint8_t size2);
void OLED_ShowChar(uint8_t x, uint8_t y, uint8_t chr, uint8_t Char_Size);
void OLED_ShowString(uint8_t x, uint8_t y, uint8_t *chr, uint8_t Char_Size);
void OLED_ShowCHinese(uint8_t x, uint8_t y, uint8_t no);

#endif
